import os
import datetime
import re

CITY_NAME = ['徐州', '盘锦', '淮北', '衡阳', '娄底', '江西', '巫山', '丽江', '银川', '宜宾', '岳阳', '咸阳', '黔东南', '沈阳', '佳木斯', '毕节', '淄博',
             '鄂尔多斯', '临夏', '固原', '云南', '遵义', '蚌埠', '南平', '万宁', '中山', '鹤岗', '咸宁', '阜新', '渭南', '达州', '乌兰察布', '澳门', '十堰',
             '上饶', '枣庄', '琼海', '彰化', '嘉义县', '烟台', '牡丹江', '大庆', '石嘴山', '河北', '天津', '威海', '天水', '阜阳', '吉安', '通辽', '商洛',
             '昌吉', '七台河', '新竹县', '丰都', '乌鲁木齐', '长沙', '南昌', '玉溪', '张家口', '辽源', '云林', '南京', '成都', '玉林', '佛山', '吉林市',
             '呼伦贝尔', '自贡', '廊坊', '德州', '乐东', '吉林', '常州', '营口', '崇左', '资阳', '澄迈', '海南', '潮汕地区', '黄山', '福州', '宜昌',
             '大兴安岭', '本溪', '和田', '台南', '朝阳', '海南藏族自治州', '林芝', '肇庆', '景德镇', '宣城', '曲靖', '晋中', '南投', '云浮', '鸡西', '无锡',
             '柳州', '惠州', '泰安', '攀枝花', '三沙', '新安江', '大理', '漳州', '齐齐哈尔', '淮南', '驻马店', '忻州', '海西', '北京', '开封', '洛阳', '运城',
             '鄂州', '文昌', '台湾', '日喀则', '临汾', '辽阳', '湖北', '桂林', '延边', '嘉义市', '河池', '吕梁', '中国', '石柱', '南充', '绥化', '铜川',
             '河南', '伊犁', '东方', '北疆', '青岛', '丹东', '延安', '平凉', '南阳', '广元', '日照', '滨州', '钦州', '保亭', '巴音郭楞', '果洛', '太原',
             '长春', '长白山', '常德', '孝感', '临高', '厦门', '酒泉', '湘西', '百色', '内江', '山东', '安徽', '城口', '秦皇岛', '南宁', '凉山', '奉节',
             '上海', '亳州', '金昌', '通化', '博尔塔拉', '图木舒克', '垫江', '彭水', '三亚', '承德', '江门', '甘南', '红河', '广州', '衢州', '鞍山', '武威',
             '潮州', '楚雄', '聊城', '定安', '贵州', '双河', '大连', '扬州', '宁波', '鹰潭', '莆田', '新乡', '汉中', '防城港', '屯昌', '阿克苏', '坝上',
             '杭州', '昆明', '淮安', '衡水', '白城', '潜江', '湘潭', '梧州', '滁州', '襄阳', '三明', '广安', '黔南', '武汉', '张掖', '锡林郭勒盟', '宿州',
             '定西', '琼中', '普洱', '新疆', '广西', '张家界', '郴州', '昭通', '太湖', '许昌', '阿坝', '台东', '新余', '天门', '广东', '呼和浩特', '潍坊',
             '台北', '芜湖', '安康', '五家渠', '北屯', '白洋淀', '葫芦岛', '泰州', '德宏', '黄冈', '临沧', '宜兰', '黔西南', '青海', '武功山', '哈尔滨',
             '文山', '萍乡', '巴彦淖尔', '铁门关', '海北', '南疆', '巫溪', '拉萨', '长江三峡', '唐山', '河源', '漯河', '中卫', '马祖', '可克达拉', '南通',
             '黑河', '安阳', '铜陵', '恩施', '桃园', '海口', '济南', '兰州', '宝鸡', '丽水', '邯郸', '怒江', '周口', '黄石', '池州', '随州', '九江',
             '西藏', '福建', '黑龙江', '浙江', '金华', '白沙', '怀化', '六盘水', '巴中', '基隆', '郑州', '赤峰', '宿迁', '遂宁', '茂名', '济宁', '宜春',
             '平顶山', '永州', '长治', '石河子', '四川', '包头', '赣州', '梅州', '昌都', '濮阳', '荆门', '庆阳', '眉山', '西安', '绍兴', '湖州', '乐山',
             '温州', '鹤壁', '仙桃', '邵阳', '屏东', '内蒙古', '珠海', '安庆', '韶关', '临沂', '宁德', '焦作', '晋城', '陵水', '甘肃', '江苏', '迪庆',
             '泸沽湖', '嘉兴', '保山', '儋州', '玉树', '黄南', '塞罕坝', '昆玉', '忠县', '云阳', '香港', '石家庄', '湛江', '东莞', '西宁', '嘉峪关', '伊春',
             '东营', '汕尾', '花莲', '台中', '宁夏', '合肥', '汕头', '青海湖', '保定', '四平', '来宾', '白山', '昌江', '辽宁', '三山岛', '阿里', '连云港',
             '阿勒泰', '信阳', '锦州', '清远', '济源', '甘孜', '双鸭山', '益阳', '湖南', '北海', '重庆', '铁岭', '乌海', '贺州', '高雄', '阳泉', '绵阳',
             '五指山', '海东', '秀山', '西双版纳', '泉州', '抚顺', '山西', '舟山', '松原', '大同', '六安', '马鞍山', '安顺', '菏泽', '贵港', '塔城', '株洲',
             '雪乡', '酉阳', '贵阳', '喀什', '龙岩', '台州', '邢台', '德阳', '商丘', '兴安盟', '雅安', '金门', '陕西', '阿拉尔', '苏州', '深圳', '神农架',
             '克拉玛依', '三门峡', '沧州', '铜仁', '揭阳', '吴忠', '朔州', '镇江', '山南', '阳江', '荆州', '榆林', '盐城', '泸州', '白银', '抚州', '澎湖',
             '陇南']

t = datetime.datetime.now()
TODAY = '%d-%02d-%02d' % (t.year, t.month, t.day)
yd = t - datetime.timedelta(days=1)
YESTERDAY = '%d-%02d-%02d' % (yd.year, yd.month, yd.day)
RE_PUNCTUATION = re.compile(r'[^\u4e00-\u9fa5a-zA-Z0-9]+')

CURRENT_PATH = os.path.join(os.path.dirname(__file__), os.path.pardir)
PROJECT_PATH = os.path.abspath(CURRENT_PATH)
FILE_PATH = os.path.join(PROJECT_PATH, 'FILE')
CONF_PATH = os.path.join(PROJECT_PATH, 'CONF')
RESULT_PATH = os.path.join(PROJECT_PATH, 'RESULT')
TEMPLATE_PATH = os.path.join(PROJECT_PATH, 'templates')
STATIC_PATH = os.path.join(PROJECT_PATH, 'static')